/*******************************************************************************
* file:         wnode.h                                                        *
* version:      0.1.0                                                          *
* author:       mice (mailto:my_mice@mail.ru, ICQ:332-292-380)                 *
* description:  not available                                                  *
* tests:        none                                                           *
*******************************************************************************/

#pragma once

#ifndef WIC_LIBWIC_WNODE
#define WIC_LIBWIC_WNODE

////////////////////////////////////////////////////////////////////////////////
// headers

// standard C++ library headers
// none

// libwic headers
#include <wic/libwic/types.h>


////////////////////////////////////////////////////////////////////////////////
// wic namespace
namespace wic {


////////////////////////////////////////////////////////////////////////////////
// types


////////////////////////////////////////////////////////////////////////////////
// wnode struct declaration

//! \brief Узел дерева вейвлет коэффициентов
/*!	\sa wtree
*/
struct wnode {
	//! \brief Значение вейвлет коэффициента в узле
	w_t w;
	//! \brief Значение проквантованного вейвлет коэффициента в узле
	w_t wc;
	//!	\brief Значение откорректированного коэффициента
	wk_t wk;
	//! \brief Значение функции Лагранжа при подрезании ветви
	j_t j0;
	//! \brief Значение функции Лагранжа при сохранении ветви
	j_t j1;
	//! \brief Групповой признак подрезания ветвей
	n_t n;
	//!	\brief Флаг, указывающий, попал коэффициент в подрезанную ветвь или нет
	bool invalid;
};



}	// end of namespace wic



#endif	// WIC_LIBWIC_WNODE
